In [98]:
import pandas as pd #Importing the pandas library 
df = pd.read_csv("titanic.csv")
df.head()

,PassengerId,Name,Pclass,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,Survived
0,1,"Braund, Mr. Owen Harris",3,male,22.0,1,0,A/5 21171,7.2500,NaN,S,0
1,2,"Cumings, Mrs. John Bradley (Florence Briggs Th...",1,female,38.0,1,0,PC 17599,71.2833,C85,C,1
2,3,"Heikkinen, Miss. Laina",3,female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S,1
3,4,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",1,female,35.0,1,0,113803,53.1000,C123,S,1
4,5,"Allen, Mr. William Henry",3,male,35.0,0,0,373450,8.0500,NaN,S,0

### Here some of the features are not relevent so we are going to assume that they dont have any impact on our target variable. For example name because it doesnt have any impact on the survival rate. So we are going to drop that variables

In [99]:
df.drop(['PassengerId','Name','SibSp','Parch','Ticket','Cabin','Embarked'],axis='columns',inplace=True)
df.head()

   Pclass     Sex   Age     Fare  Survived
0       3    male  22.0   7.2500         0
1       1  female  38.0  71.2833         1
2       3  female  26.0   7.9250         1
3       1  female  35.0  53.1000         1
4       3    male  35.0   8.0500         0

### Here our target variable is Survived so we have to saperate out in in different series

In [100]:
target = df.Survived
inputs = df.drop('Survived',axis='columns')

### Here we can see that the sex column is text and then we have to convert it into summy columns because the ML models cant handle text so we have to convert it into numbers.
### So here we convert it into dummies it will basically convert the sex column into two different columns and it will just put 0 and 1 values

In [101]:
dummies = pd.get_dummies(inputs.Sex)
dummies.head(3)

   female  male
0       0     1
1       1     0
2       1     0

### Now we are going to append these dummies columns to our "inputs" dataframe this is done by using pandas "concat" function where we can concat these two dataframes on columns

In [102]:
inputs = pd.concat([inputs,dummies],axis = 'columns')
inputs.head(3)

   Pclass     Sex   Age     Fare  female  male
0       3    male  22.0   7.2500       0     1
1       1  female  38.0  71.2833       1     0
2       3  female  26.0   7.9250       1     0

### We can see that in the above inputs dataframe we have two new columns male and female 
### After this we have also need to drop the original sex column because it has text data

In [103]:
inputs.drop('Sex',axis='columns',inplace = True)
inputs.head(3)

   Pclass   Age     Fare  female  male
0       3  22.0   7.2500       0     1
1       1  38.0  71.2833       1     0
2       3  26.0   7.9250       1     0

### Now we have to found if there is any na numbers in any columns and it is done by using following code :

In [104]:
inputs.columns[inputs.isna().any()]

Index(['Age'], dtype='object')

### From above output we get that the Age columns has sone NA numbers

In [105]:
inputs.Age[:15] #printing firest 15 values

0     22.0
1     38.0
2     26.0
3     35.0
4     35.0
5      NaN
6     54.0
7      2.0
8     27.0
9     14.0
10     4.0
11    58.0
12    20.0
13    39.0
14    14.0
Name: Age, dtype: float64

### To handle this NAN values we sre going to use the popular approch which is by taking its "mean" of the entire column an feel those NAN values by the mean value.

In [106]:
inputs.Age = inputs.Age.fillna(inputs.Age.mean())
inputs.head(10)

   Pclass        Age     Fare  female  male
0       3  22.000000   7.2500       0     1
1       1  38.000000  71.2833       1     0
2       3  26.000000   7.9250       1     0
3       1  35.000000  53.1000       1     0
4       3  35.000000   8.0500       0     1
5       3  29.699118   8.4583       0     1
6       1  54.000000  51.8625       0     1
7       3   2.000000  21.0750       0     1
8       3  27.000000  11.1333       1     0
9       2  14.000000  30.0708       1     0

### Now we are going to use sklearns strain test split method to split our dataset into traning and taste sample this is what we usually so before traning our model so that the model is not baised when we are trying to sore and this is done by the following code

### Here we are going to devide the test train smple into 20:80 percent ratio

In [107]:
from sklearn.model_selection import train_test_split
x_train,x_test,y_train,y_test = train_test_split(inputs,target,test_size = 0.2)

In [108]:
len(x_train)

712

In [109]:
len(x_test)

179

In [110]:
len(inputs)

891

### In above values we see that the data is divided into 80:20 ratio
### To create the naive based model here we are going to use Gaussion Naive base It us used when our data distribution is normal or it is like a gaussian distribution this is the concept of the statistics it is also called the bell curve
### To create this model we use above code

In [111]:
from sklearn.naive_bayes import GaussianNB
model = GaussianNB()

### Whenever we want to train the model we have to call the "fit" method

In [112]:
model.fit(x_train,y_train)

GaussianNB()

In [113]:
model.score(x_test,y_test)

0.7932960893854749

### After our model is trained we measure the score to find the accuracy. It allows a model to be evaluated taking both the precision and recall into account using a single score, which is helpful when describing the performance of the model and in comparing models.It depends on the samples

In [114]:
x_test[:10]

     Pclass   Age      Fare  female  male
572       1  36.0   26.3875       0     1
172       3   1.0   11.1333       1     0
731       3  11.0   18.7875       0     1
230       1  35.0   83.4750       1     0
355       3  28.0    9.5000       0     1
199       2  24.0   13.0000       1     0
205       3   2.0   10.4625       1     0
441       3  20.0    9.5000       0     1
742       1  21.0  262.3750       1     0
663       3  36.0    7.4958       0     1

In [115]:
y_test[:10]

572    1
172    1
731    0
230    1
355    0
199    0
205    0
441    0
742    1
663    0
Name: Survived, dtype: int64

### So the prediction of sirvival is :

In [116]:
model.predict(x_test[:10])

array([0, 1, 0, 1, 0, 1, 1, 0, 1, 0], dtype=int64)

### Below data is the probablity of sirvival

In [117]:
model.predict_proba(x_test[:10])

array([[9.26299190e-01, 7.37008095e-02],
       [3.92711324e-02, 9.60728868e-01],
       [9.85793264e-01, 1.42067358e-02],
       [1.44449821e-03, 9.98555502e-01],
       [9.90506247e-01, 9.49375285e-03],
       [3.94461167e-02, 9.60553883e-01],
       [4.10829645e-02, 9.58917036e-01],
       [9.89005570e-01, 1.09944297e-02],
       [5.41315160e-15, 1.00000000e+00],
       [9.90917348e-01, 9.08265205e-03]])